Revit 2021.1 API
Floor.SpanDirectionAngle Property
Retrieve the span direction angle of the floor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
public double SpanDirectionAngle { get; set; }
Visual Basic
Public Property SpanDirectionAngle As Double
	Get
	Set
Visual C++
public:
property double SpanDirectionAngle {
	double get ();
	void set (double value);
}
Remarks
The angle returned is in radians. An exception will be thrown if the floor is non structural.
See Also
Floor Class
Autodesk.Revit.DB Namespace